import os
import re

# 获取当前文件夹下所有文件名
import argparse
import os.path as osp


success = ['49', '32', '84', '0', '150', '319', '317', '279', '97', '41', '141', '81', '309', '326', '53', '217', '216', '202', '28', '253', '335', '196', '157', '236', '131', '155', '79']
fail = ['185', '251', '302', '221', '290', '46', '213', '284', '153', '241', '198', '300', '238', '190', '51', '16', '67', '245', '24', '106', '88', '50', '287', '227', '226', '29', '195', '282', '273', '280', '232', '78', '329', '316', '194', '214', '274', '95', '135', '72', '186', '162', '163', '332', '177', '305', '212', '307', '240', '312', '243', '90', '301', '289', '197', '268', '152', '206', '299', '315', '250', '187']
success_reverse = ['50', '332', '214', '326', '177', '335', '309', '186', '84', '157', '190', '155', '213', '329', '16', '227', '53', '49', '317', '106', '280', '196', '307', '152', '302', '238', '78']
fail_reverse = ['79', '312', '88', '141', '51', '95', '300', '29', '198', '32', '245', '212', '90', '316', '253', '319', '150', '202', '290', '135', '268', '185', '287', '216', '194', '301', '289', '97', '279', '315', '284', '274', '162', '28', '232', '46', '197', '163', '24', '0', '236', '67', '251', '282', '217', '250', '206', '187', '226', '273', '153', '41', '243', '299', '221', '131', '241', '72', '81', '195', '240', '305']


# if success_reverse:
#     print(f"{reversed_dir_name} 文件夹下成功的 episode 标号为: {success_reverse}")
# else:
#     print(f"{reversed_dir_name} 文件夹下没有找到成功的 episode。")
# if fail_reverse:
#     print(f"{reversed_dir_name} 文件夹下失败的 episode 标号为: {fail_reverse}")
# else:
#     print(f"{reversed_dir_name} 文件夹下没有找到失败的 episode。")


# 获取配置A成功和配置B失败的并集
selected_result = list(set(list(set(success_reverse) & set(fail))))
success_result = list(set(success) & set(success_reverse))
fail_result = list(set(fail) & set(fail_reverse))

print(f"筛选出的数据集编号: {selected_result}, 成功比例: {len(selected_result) / (len(success) + len(fail))}")
print("同时成功的数据集编号:", success_result)
print("同时失败的数据集编号:", fail_result)
